MakenL/System_STM32F103x/inc/system_stm32f103x.h
/** @file     system_stm32f103x.h
    @author   Lyga Maksim
    @version  V1.0
    @date     20.07.2015
 */
 
#ifndef __SYSTEM_STM32F103X_H
#define __SYSTEM_STM32F103X_H
 
#ifdef __cplusplus
 extern "C" {
#endif 
 
/* ПОДКЛЮЧЕНИЕ ЗАГОЛОВОЧНЫХ ФАЙЛОВ
 *************************************************************************************************/	
 
#include "stm32f103x.h"
	 
/* МАСТЕР КОНФИГУРАЦИИ
 *************************************************************************************************/
	 
//********************** <<< Use Configuration Wizard in Context Menu >>> **********************
// <h> Clock Configuration
//   <e0> HSEON: External High Speed clock enable 
//   <i> Default: HSE oscillator OFF (register RCC_CR)
//     <o7> External High Speed Clock [Hz] <4000000-16000000>
//     <i> clock value for the used External High Speed Clock (4MHz <= HSE <= 16MHz).
//     <i> Default: 8000000  (8MHz)
//     <o9> Time out for HSE start up <1000-32000>
//     <i> Default: 1280
//     <q1> CSSON: Clock Security System enable
//     <i> Default: Clock detector OFF (register RCC_CR)
//     <q2> HSEBYP: External High Speed clock Bypass
//     <i> Default: HSE oscillator not bypassed (register RCC_CR)
//   </e>
//   <e3> HSION: Internal High Speed clock enable
//   <i> Default: internal 8MHz RC oscillator ON (register RCC_CR)
//     <o4.3..7> HSITRIM: Internal High Speed clock trimming  <0-31>
//     <i> Default: 0x10 (register RCC_CR)
//   </e>
//   <e5> PLLON: PLL enable         
//   <i> Default: PLL Disabled (register RCC_CR)
//     <o6.17> PLLXTPRE: HSE divider for PLL entry
//     <i> Default: HSE (register RCC_CFGR)
//                   <0=> HSE
//                   <1=> HSE / 2
//     <o6.16> PLLSRC: PLL entry clock source         
//     <i> Default: HSI/2 (register RCC_CFGR)
//                   <0=> HSI / 2
//                   <1=> HSE (PLLXTPRE output)
//     <o6.18..21> PLLMUL: PLL Multiplication Factor
//     <i> Default: PLLSRC * 2 (register RCC_CFGR)
//                   <0=> PLLSRC * 2
//                   <1=> PLLSRC * 3
//                   <2=> PLLSRC * 4
//                   <3=> PLLSRC * 5
//                   <4=> PLLSRC * 6
//                   <5=> PLLSRC * 7
//                   <6=> PLLSRC * 8
//                   <7=> PLLSRC * 9
//                   <8=> PLLSRC * 10
//                   <9=> PLLSRC * 11
//                   <10=> PLLSRC * 12
//                   <11=> PLLSRC * 13
//                   <12=> PLLSRC * 14
//                   <13=> PLLSRC * 15
//                   <14=> PLLSRC * 16
//   </e>
//   <o6.0..1> SW: System Clock Switch
//   <i> Default: SYSCLK = HSI (register RCC_CFGR)
//                   <0=> SYSCLK = HSI
//                   <1=> SYSCLK = HSE
//                   <2=> SYSCLK = PLLCLK
//   <h> Configuration prescalers
//   <o6.4..7> HPRE: AHB prescaler 
//   <i> Default: HCLK = SYSCLK (register RCC_CFGR)
//                   <0=> HCLK = SYSCLK
//                   <8=> HCLK = SYSCLK / 2
//                   <9=> HCLK = SYSCLK / 4
//                   <10=> HCLK = SYSCLK / 8
//                   <11=> HCLK = SYSCLK / 16
//                   <12=> HCLK = SYSCLK / 64
//                   <13=> HCLK = SYSCLK / 128
//                   <14=> HCLK = SYSCLK / 256
//                   <15=> HCLK = SYSCLK / 512
//   <o6.11..13> PPRE2: APB High speed prescaler (APB2)
//   <i> Default: PCLK2 = HCLK (register RCC_CFGR)
//                   <0=> PCLK2 = HCLK
//                   <4=> PCLK2 = HCLK / 2 
//                   <5=> PCLK2 = HCLK / 4 
//                   <6=> PCLK2 = HCLK / 8 
//                   <7=> PCLK2 = HCLK / 16 
//   <o6.8..10> PPRE1: APB Low speed prescaler (APB1) 
//   <i> Default: PCLK1 = HCLK (register RCC_CFGR)
//                   <0=> PCLK1 = HCLK
//                   <4=> PCLK1 = HCLK / 2 
//                   <5=> PCLK1 = HCLK / 4 
//                   <6=> PCLK1 = HCLK / 8 
//                   <7=> PCLK1 = HCLK / 16 
//   <o6.22> USBPRE: USB prescaler
//   <i> Default: USBCLK = PLLCLK / 1.5 (register RCC_CFGR)
//                   <0=> USBCLK = PLLCLK / 1.5
//                   <1=> USBCLK = PLLCLK
//   <o6.14..15> ADCPRE: ADC prescaler
//   <i> Default: ADCCLK=PCLK2 / 2 (register RCC_CFGR)
//                   <0=> ADCCLK = PCLK2 / 2
//                   <1=> ADCCLK = PCLK2 / 4
//                   <2=> ADCCLK = PCLK2 / 6
//                   <3=> ADCCLK = PCLK2 / 8
//   </h>
//   <o6.24..26> MCO: Microcontroller Clock Output   
//   <i> Default: MCO = noClock (register RCC_CFGR)
//                   <0=> MCO = noClock
//                   <4=> MCO = SYSCLK
//                   <5=> MCO = HSI
//                   <6=> MCO = HSE
//                   <7=> MCO = PLLCLK / 2
// </h> End of Clock Configuration

#define __HSEON        1
#define __CSSON        1
#define __HSEBYP       0
#define __HSION        1
#define __HSITRIM      0x80
#define __PLLON        1
#define __RCC_CFGR     0x001D4402
#define __HSE_CLOCK    8000000
#define __HSI_CLOCK    8000000
#define __HSE_TIMEOUT  ((uint16_t)1300)

//<e0> Real Time Clock Configuration
//  <o1.8..9> RTC clock source selection
//  <i> Default: No Clock
//               <0=> No Clock
//               <1=> RTCCLK = LSE (32,768kHz)
//               <2=> RTCCLK = LSI (32 kHz)
//               <3=> RTCCLK = HSE/128
//  <o2> RTC period [ms] <10-1000:10>
//  <i> Set the timer period for Real Time Clock.
//  <i> Default: 1000  (1s)
//  <h> RTC interrupts
//      <o3.0> RTC_CRH.SECIE: Second interrupt enabled
//      <o3.1> RTC_CRH.ALRIE: Alarm interrupt enabled
//      <o3.2> RTC_CRH.OWIE: Overflow interrupt enabled
//  </h>
//</e>

#define __RTC_USED        1
#define __RCC_BDCR        0x00000100
#define __RTC_PERIOD      1000
#define __RTC_CRH         0x0001
#define __LSE_CLOCK       32768
#define __LSI_CLOCK       32000

// <h> Embedded Flash Configuration
//   <o0.0..2> LATENCY: Latency
//   <i> Default: 2 wait states
//                   <0=> 0 wait states
//                   <1=> 1 wait states
//                   <2=> 2 wait states
//   <o0.3> HLFCYA: Flash Half Cycle Access Enable
//   <o0.4> PRFTBE: Prefetch Buffer Enable
// </h>
#define __FLASH_ACR      ((uint32_t)0x00000012)

// <h> Nested Vectored Interrupt Controller (NVIC)
//   <o0> Vector Table Base
//   <i> Default: FLASH
//                   <0=> FLASH
//                   <1=> RAM
//   <o1> Vector Table Offset <0x0-0x1FFFFFC0:0x200>
//   <i> Vector Table base offset field. This value must be a multiple of 0x200
//   <i> Default: 0x00000000 
// </h>
#define __VECT_TAB_BASE   0
#define __VECT_TAB_OFFSET ((uint32_t)0x00000000)

// <e0> System Timer Configuration
//   <o1.2> System Timer clock source selection
//   <i> Default: SYSTICKCLK = HCLK/8
//                     <0=> SYSTICKCLK = HCLK/8
//                     <1=> SYSTICKCLK = HCLK
//   <o1.1> System Timer interrupt enabled
//   <o2> SYSTICK max period [ms] <100-1000>
//   <i> Set the timer max period for System Timer.
//   <i> Default: 1000 (1s)
// </e>
#define __SYSTICK_SETUP           1
#define __SYSTICK_CTRL            0x00000006
#define __SYSTICK_MAXPERIOD       100
#define __SYSTEM_TIMER_COUNT      5

