MakenL/System_STM32F103x/inc/system_stm32f103x.h
//  <e0.31> GPIOD port
//  <i> Port GPIOD clock enable. Port GPIOD is relevant to STM32F103Vx, STM32F103Zx.
//      <e0.0> GPIOD0 pin
//          <o1.0..3> Pin used as 
//                <0=>Analog Input
//                <4=>Floating (HiZ) Input
//                <8=>Input with pull-up / pull-down
//                <2=>General Purpose Output push-pull (max speed  2MHz)
//                <1=>General Purpose Output push-pull (max speed 10MHz)
//                <3=>General Purpose Output push-pull (max speed 50MHz)
//                <6=>General Purpose Output open-drain (max speed  2MHz)
//                <5=>General Purpose Output open-drain (max speed 10MHz)
//                <7=>General Purpose Output open-drain (max speed 50MHz)
//                <10=>Alternate Function push-pull (max speed  2MHz)
//                <9=>Alternate Function push-pull (max speed 10MHz)
//                <11=>Alternate Function push-pull (max speed 50MHz)
//                <14=>Alternate Function open-drain (max speed  2MHz)
//                <13=>Alternate Function open-drain (max speed 10MHz)
//                <15=>Alternate Function open-drain (max speed 50MHz)
//          <o3.0> Start output level 
//                <0=>0 - Low <1=>1 - High
//          <o4.0> Locked setup 
//               <0=>0 - Unlocked <1=>1 - Locked
//      </e>
//      <e0.1> GPIOD1 pin
//          <o1.4..7> Pin used as 
//                <0=>Analog Input
//                <4=>Floating (HiZ) Input
//                <8=>Input with pull-up / pull-down
//                <2=>General Purpose Output push-pull (max speed  2MHz)
//                <1=>General Purpose Output push-pull (max speed 10MHz)
//                <3=>General Purpose Output push-pull (max speed 50MHz)
//                <6=>General Purpose Output open-drain (max speed  2MHz)
//                <5=>General Purpose Output open-drain (max speed 10MHz)
//                <7=>General Purpose Output open-drain (max speed 50MHz)
//                <10=>Alternate Function push-pull (max speed  2MHz)
//                <9=>Alternate Function push-pull (max speed 10MHz)
//                <11=>Alternate Function push-pull (max speed 50MHz)
//                <14=>Alternate Function open-drain (max speed  2MHz)
//                <13=>Alternate Function open-drain (max speed 10MHz)
//                <15=>Alternate Function open-drain (max speed 50MHz)
//          <o3.1> Start output level
//                <0=>0 - Low <1=>1 - High
//          <o4.1> Locked setup 
//               <0=>0 - Unlocked <1=>1 - Locked
//      </e>
//      <e0.2> GPIOD2 pin
//          <o1.8..11> Pin used as 
//                <0=>Analog Input
//                <4=>Floating (HiZ) Input
//                <8=>Input with pull-up / pull-down
//                <2=>General Purpose Output push-pull (max speed  2MHz)
//                <1=>General Purpose Output push-pull (max speed 10MHz)
//                <3=>General Purpose Output push-pull (max speed 50MHz)
//                <6=>General Purpose Output open-drain (max speed  2MHz)
//                <5=>General Purpose Output open-drain (max speed 10MHz)
//                <7=>General Purpose Output open-drain (max speed 50MHz)
//                <10=>Alternate Function push-pull (max speed  2MHz)
//                <9=>Alternate Function push-pull (max speed 10MHz)
//                <11=>Alternate Function push-pull (max speed 50MHz)
//                <14=>Alternate Function open-drain (max speed  2MHz)
//                <13=>Alternate Function open-drain (max speed 10MHz)
//                <15=>Alternate Function open-drain (max speed 50MHz)
//          <o3.2> Start output level
//                <0=>0 - Low <1=>1 - High
//          <o4.2> Locked setup 
//               <0=>0 - Unlocked <1=>1 - Locked
//      </e>
//      <e0.3> GPIOD3 pin
//          <o1.12..15> Pin used as 
//                <0=>Analog Input
//                <4=>Floating (HiZ) Input
//                <8=>Input with pull-up / pull-down
//                <2=>General Purpose Output push-pull (max speed  2MHz)
//                <1=>General Purpose Output push-pull (max speed 10MHz)
//                <3=>General Purpose Output push-pull (max speed 50MHz)
//                <6=>General Purpose Output open-drain (max speed  2MHz)
//                <5=>General Purpose Output open-drain (max speed 10MHz)
//                <7=>General Purpose Output open-drain (max speed 50MHz)
//                <10=>Alternate Function push-pull (max speed  2MHz)
//                <9=>Alternate Function push-pull (max speed 10MHz)
//                <11=>Alternate Function push-pull (max speed 50MHz)
//                <14=>Alternate Function open-drain (max speed  2MHz)
//                <13=>Alternate Function open-drain (max speed 10MHz)
//                <15=>Alternate Function open-drain (max speed 50MHz)
//          <o3.3> Start output level
//                <0=>0 - Low <1=>1 - High
//          <o4.3> Locked setup 
//               <0=>0 - Unlocked <1=>1 - Locked
//      </e>
//      <e0.4> GPIOD4 pin
//          <o1.16..19> Pin used as 
//                <0=>Analog Input
//                <4=>Floating (HiZ) Input
//                <8=>Input with pull-up / pull-down
//                <2=>General Purpose Output push-pull (max speed  2MHz)
//                <1=>General Purpose Output push-pull (max speed 10MHz)
//                <3=>General Purpose Output push-pull (max speed 50MHz)
//                <6=>General Purpose Output open-drain (max speed  2MHz)
//                <5=>General Purpose Output open-drain (max speed 10MHz)
//                <7=>General Purpose Output open-drain (max speed 50MHz)
//                <10=>Alternate Function push-pull (max speed  2MHz)
//                <9=>Alternate Function push-pull (max speed 10MHz)
//                <11=>Alternate Function push-pull (max speed 50MHz)
//                <14=>Alternate Function open-drain (max speed  2MHz)
//                <13=>Alternate Function open-drain (max speed 10MHz)
//                <15=>Alternate Function open-drain (max speed 50MHz)
//          <o3.4> Start output level
//                <0=>0 - Low <1=>1 - High
//          <o4.4> Locked setup 
//               <0=>0 - Unlocked <1=>1 - Locked
//      </e>
//      <e0.5> GPIOD5 pin
//          <o1.20..23> Pin used as 
//                <0=>Analog Input
//                <4=>Floating (HiZ) Input
//                <8=>Input with pull-up / pull-down
//                <2=>General Purpose Output push-pull (max speed  2MHz)
//                <1=>General Purpose Output push-pull (max speed 10MHz)
//                <3=>General Purpose Output push-pull (max speed 50MHz)
//                <6=>General Purpose Output open-drain (max speed  2MHz)
//                <5=>General Purpose Output open-drain (max speed 10MHz)
//                <7=>General Purpose Output open-drain (max speed 50MHz)
//                <10=>Alternate Function push-pull (max speed  2MHz)
//                <9=>Alternate Function push-pull (max speed 10MHz)
//                <11=>Alternate Function push-pull (max speed 50MHz)
//                <14=>Alternate Function open-drain (max speed  2MHz)
//                <13=>Alternate Function open-drain (max speed 10MHz)
//                <15=>Alternate Function open-drain (max speed 50MHz)
//          <o3.5> Start output level
//                <0=>0 - Low <1=>1 - High
//          <o4.5> Locked setup 
//               <0=>0 - Unlocked <1=>1 - Locked
//      </e>
//      <e0.6> GPIOD6 pin
//          <o1.24..27> Pin used as 
//                <0=>Analog Input
//                <4=>Floating (HiZ) Input
//                <8=>Input with pull-up / pull-down
//                <2=>General Purpose Output push-pull (max speed  2MHz)
//                <1=>General Purpose Output push-pull (max speed 10MHz)
//                <3=>General Purpose Output push-pull (max speed 50MHz)
//                <6=>General Purpose Output open-drain (max speed  2MHz)
//                <5=>General Purpose Output open-drain (max speed 10MHz)
//                <7=>General Purpose Output open-drain (max speed 50MHz)
//                <10=>Alternate Function push-pull (max speed  2MHz)
//                <9=>Alternate Function push-pull (max speed 10MHz)
//                <11=>Alternate Function push-pull (max speed 50MHz)
//                <14=>Alternate Function open-drain (max speed  2MHz)
//                <13=>Alternate Function open-drain (max speed 10MHz)
//                <15=>Alternate Function open-drain (max speed 50MHz)
//          <o3.6> Start output level
//                <0=>0 - Low <1=>1 - High
//          <o4.6> Locked setup 
//               <0=>0 - Unlocked <1=>1 - Locked
//      </e>
//      <e0.7> GPIOD7 pin
//          <o1.28..31> Pin used as 
//                <0=>Analog Input
//                <4=>Floating (HiZ) Input
//                <8=>Input with pull-up / pull-down
//                <2=>General Purpose Output push-pull (max speed  2MHz)
//                <1=>General Purpose Output push-pull (max speed 10MHz)
//                <3=>General Purpose Output push-pull (max speed 50MHz)
//                <6=>General Purpose Output open-drain (max speed  2MHz)
//                <5=>General Purpose Output open-drain (max speed 10MHz)
//                <7=>General Purpose Output open-drain (max speed 50MHz)
//                <10=>Alternate Function push-pull (max speed  2MHz)
//                <9=>Alternate Function push-pull (max speed 10MHz)
//                <11=>Alternate Function push-pull (max speed 50MHz)
//                <14=>Alternate Function open-drain (max speed  2MHz)
//                <13=>Alternate Function open-drain (max speed 10MHz)
//                <15=>Alternate Function open-drain (max speed 50MHz)
//          <o3.7> Start output level
//                <0=>0 - Low <1=>1 - High
//          <o4.7> Locked setup 
//               <0=>0 - Unlocked <1=>1 - Locked
//      </e>
//      <e0.8> GPIOD8 pin
//          <o2.0..3> Pin used as 
//                <0=>Analog Input
//                <4=>Floating (HiZ) Input
//                <8=>Input with pull-up / pull-down
//                <2=>General Purpose Output push-pull (max speed  2MHz)
//                <1=>General Purpose Output push-pull (max speed 10MHz)
//                <3=>General Purpose Output push-pull (max speed 50MHz)
//                <6=>General Purpose Output open-drain (max speed  2MHz)
//                <5=>General Purpose Output open-drain (max speed 10MHz)
//                <7=>General Purpose Output open-drain (max speed 50MHz)
//                <10=>Alternate Function push-pull (max speed  2MHz)
//                <9=>Alternate Function push-pull (max speed 10MHz)
//                <11=>Alternate Function push-pull (max speed 50MHz)
//                <14=>Alternate Function open-drain (max speed  2MHz)
//                <13=>Alternate Function open-drain (max speed 10MHz)
//                <15=>Alternate Function open-drain (max speed 50MHz)
//          <o3.8> Start output level
//                <0=>0 - Low <1=>1 - High
//          <o4.8> Locked setup 
//               <0=>0 - Unlocked <1=>1 - Locked
//      </e>
//      <e0.9> GPIOD9 pin
//          <o2.4..7> Pin used as 
//                <0=>Analog Input
//                <4=>Floating (HiZ) Input
//                <8=>Input with pull-up / pull-down
//                <2=>General Purpose Output push-pull (max speed  2MHz)
//                <1=>General Purpose Output push-pull (max speed 10MHz)
//                <3=>General Purpose Output push-pull (max speed 50MHz)
//                <6=>General Purpose Output open-drain (max speed  2MHz)
//                <5=>General Purpose Output open-drain (max speed 10MHz)
//                <7=>General Purpose Output open-drain (max speed 50MHz)
//                <10=>Alternate Function push-pull (max speed  2MHz)
//                <9=>Alternate Function push-pull (max speed 10MHz)
//                <11=>Alternate Function push-pull (max speed 50MHz)
//                <14=>Alternate Function open-drain (max speed  2MHz)
//                <13=>Alternate Function open-drain (max speed 10MHz)
//                <15=>Alternate Function open-drain (max speed 50MHz)
//          <o3.9> Start output level
//                <0=>0 - Low <1=>1 - High
//          <o4.9> Locked setup 
//               <0=>0 - Unlocked <1=>1 - Locked
//      </e>
//      <e0.10> GPIOD10 pin
//          <o2.8..11> Pin used as 
//                <0=>Analog Input
//                <4=>Floating (HiZ) Input
//                <8=>Input with pull-up / pull-down
//                <2=>General Purpose Output push-pull (max speed  2MHz)
//                <1=>General Purpose Output push-pull (max speed 10MHz)
//                <3=>General Purpose Output push-pull (max speed 50MHz)
//                <6=>General Purpose Output open-drain (max speed  2MHz)
//                <5=>General Purpose Output open-drain (max speed 10MHz)
//                <7=>General Purpose Output open-drain (max speed 50MHz)
//                <10=>Alternate Function push-pull (max speed  2MHz)
//                <9=>Alternate Function push-pull (max speed 10MHz)
//                <11=>Alternate Function push-pull (max speed 50MHz)
//                <14=>Alternate Function open-drain (max speed  2MHz)
//                <13=>Alternate Function open-drain (max speed 10MHz)
//                <15=>Alternate Function open-drain (max speed 50MHz)
//          <o3.10> Start output level
//                <0=>0 - Low <1=>1 - High
//          <o4.10> Locked setup 
//               <0=>0 - Unlocked <1=>1 - Locked
//      </e>
//      <e0.11> GPIOD11 pin
//          <o2.12..15> Pin used as 
//                <0=>Analog Input
//                <4=>Floating (HiZ) Input
//                <8=>Input with pull-up / pull-down
//                <2=>General Purpose Output push-pull (max speed  2MHz)
//                <1=>General Purpose Output push-pull (max speed 10MHz)
//                <3=>General Purpose Output push-pull (max speed 50MHz)
//                <6=>General Purpose Output open-drain (max speed  2MHz)
//                <5=>General Purpose Output open-drain (max speed 10MHz)
//                <7=>General Purpose Output open-drain (max speed 50MHz)
//                <10=>Alternate Function push-pull (max speed  2MHz)
//                <9=>Alternate Function push-pull (max speed 10MHz)
//                <11=>Alternate Function push-pull (max speed 50MHz)
//                <14=>Alternate Function open-drain (max speed  2MHz)
//                <13=>Alternate Function open-drain (max speed 10MHz)
//                <15=>Alternate Function open-drain (max speed 50MHz)
//          <o3.11> Start output level
//                <0=>0 - Low <1=>1 - High
//          <o4.11> Locked setup 
//               <0=>0 - Unlocked <1=>1 - Locked
//      </e>
//      <e0.12> GPIOD12 pin
//          <o2.16..19> Pin used as 
//                <0=>Analog Input
//                <4=>Floating (HiZ) Input
//                <8=>Input with pull-up / pull-down
//                <2=>General Purpose Output push-pull (max speed  2MHz)
//                <1=>General Purpose Output push-pull (max speed 10MHz)
//                <3=>General Purpose Output push-pull (max speed 50MHz)
//                <6=>General Purpose Output open-drain (max speed  2MHz)
//                <5=>General Purpose Output open-drain (max speed 10MHz)
//                <7=>General Purpose Output open-drain (max speed 50MHz)
//                <10=>Alternate Function push-pull (max speed  2MHz)
//                <9=>Alternate Function push-pull (max speed 10MHz)
//                <11=>Alternate Function push-pull (max speed 50MHz)
//                <14=>Alternate Function open-drain (max speed  2MHz)
//                <13=>Alternate Function open-drain (max speed 10MHz)
//                <15=>Alternate Function open-drain (max speed 50MHz)
//          <o3.12> Start output level
//                <0=>0 - Low <1=>1 - High
//          <o4.12> Locked setup 
//               <0=>0 - Unlocked <1=>1 - Locked
//      </e>
//      <e0.13> GPIOD13 pin
//          <o2.20..23> Pin used as 
//                <0=>Analog Input
//                <4=>Floating (HiZ) Input
//                <8=>Input with pull-up / pull-down
//                <2=>General Purpose Output push-pull (max speed  2MHz)
//                <1=>General Purpose Output push-pull (max speed 10MHz)
//                <3=>General Purpose Output push-pull (max speed 50MHz)
//                <6=>General Purpose Output open-drain (max speed  2MHz)
//                <5=>General Purpose Output open-drain (max speed 10MHz)
//                <7=>General Purpose Output open-drain (max speed 50MHz)
//                <10=>Alternate Function push-pull (max speed  2MHz)
//                <9=>Alternate Function push-pull (max speed 10MHz)
//                <11=>Alternate Function push-pull (max speed 50MHz)
//                <14=>Alternate Function open-drain (max speed  2MHz)
//                <13=>Alternate Function open-drain (max speed 10MHz)
//                <15=>Alternate Function open-drain (max speed 50MHz)
//          <o3.13> Start output level
//                <0=>0 - Low <1=>1 - High
//          <o4.13> Locked setup 
//               <0=>0 - Unlocked <1=>1 - Locked
//      </e>
//      <e0.14> GPIOD14 pin
//          <o2.24..27> Pin used as 
//                <0=>Analog Input
//                <4=>Floating (HiZ) Input
//                <8=>Input with pull-up / pull-down
//                <2=>General Purpose Output push-pull (max speed  2MHz)
//                <1=>General Purpose Output push-pull (max speed 10MHz)
//                <3=>General Purpose Output push-pull (max speed 50MHz)
//                <6=>General Purpose Output open-drain (max speed  2MHz)
//                <5=>General Purpose Output open-drain (max speed 10MHz)
//                <7=>General Purpose Output open-drain (max speed 50MHz)
//                <10=>Alternate Function push-pull (max speed  2MHz)
//                <9=>Alternate Function push-pull (max speed 10MHz)
//                <11=>Alternate Function push-pull (max speed 50MHz)
//                <14=>Alternate Function open-drain (max speed  2MHz)
//                <13=>Alternate Function open-drain (max speed 10MHz)
//                <15=>Alternate Function open-drain (max speed 50MHz)
//          <o3.14> Start output level
//                <0=>0 - Low <1=>1 - High
//          <o4.14> Locked setup 
//               <0=>0 - Unlocked <1=>1 - Locked
//      </e>
//      <e0.15> GPIOD15 pin
//          <o2.28..31> Pin used as 
//                <0=>Analog Input
//                <4=>Floating (HiZ) Input
//                <8=>Input with pull-up / pull-down
//                <2=>General Purpose Output push-pull (max speed  2MHz)
//                <1=>General Purpose Output push-pull (max speed 10MHz)
//                <3=>General Purpose Output push-pull (max speed 50MHz)
//                <6=>General Purpose Output open-drain (max speed  2MHz)
//                <5=>General Purpose Output open-drain (max speed 10MHz)
//                <7=>General Purpose Output open-drain (max speed 50MHz)
//                <10=>Alternate Function push-pull (max speed  2MHz)
//                <9=>Alternate Function push-pull (max speed 10MHz)
//                <11=>Alternate Function push-pull (max speed 50MHz)
//                <14=>Alternate Function open-drain (max speed  2MHz)
//                <13=>Alternate Function open-drain (max speed 10MHz)
//                <15=>Alternate Function open-drain (max speed 50MHz)
//          <o3.15> Start output level
//                <0=>0 - Low <1=>1 - High
//          <o4.15> Locked setup 
//               <0=>0 - Unlocked <1=>1 - Locked
//      </e> </e>

