MakenL/System_STM32F103x/inc/system_stm32f103x.h
#define __GPIOE_USED   0x8000FF82
#define __GPIOE_CRL    0xB2244424
#define __GPIOE_CRH    0xBBBBBBBB
#define __GPIOE_ODR    0x00000062
#define __GPIOE_LCKR   0x00000000

// <e0> Alternate Function enable
// <i> Set/reset bit AFIOEN of register APB2ENR. Alternative funftion clock enable. 
//   <h> Alternate Function remap Configuration
//     <o1.0> SPI1 remapping
//       <i> Default: No Remap (NSS/PA4, SCK/PA5, MISO/PA6, MOSI/PA7)
//                <0=> No Remap (NSS/PA4, SCK/PA5, MISO/PA6, MOSI/PA7)
//                <1=> Remap (NSS/PA15, SCK/PB3, MISO/PB4, MOSI/PB5)
//     <o1.1> I2C1 remapping
//       <i> Default: No Remap (SCL/PB6, SDA/PB7)
//                <0=> No Remap (SCL/PB6, SDA/PB7)
//                <1=> Remap (SCL/PB8, SDA/PB9)
//     <o1.2> USART1 remapping
//       <i> Default: No Remap (TX/PA9, RX/PA10)
//                <0=> No Remap (TX/PA9, RX/PA10)
//                <1=> Remap (TX/PB6, RX/PB7)
//     <o1.3> USART2 remapping
//       <i> Default: No Remap (CTS/PA0, RTS/PA1, TX/PA2, RX/PA3, CK/PA4)
//                <0=> No Remap (CTS/PA0, RTS/PA1, TX/PA2, RX/PA3, CK/PA4)
//                <1=> Remap (CTS/PD3, RTS/PD4, TX/PD5, RX/PD6, CK/PD7)
//     <o1.4..5> USART3 remapping
//       <i> Default: No Remap (TX/PB10, RX/PB11, CK/PB12, CTS/PB13, RTS/PB14)
//                <0=> No Remap (TX/PB10, RX/PB11, CK/PB12, CTS/PB13, RTS/PB14)
//                <1=> Partial Remap (TX/PC10, RX/PC11, CK/PC12, CTS/PB13, RTS/PB14)
//                <3=> Full Remap (TX/PD8, RX/PD9, CK/PD10, CTS/PD11, RTS/PD12)
//     <o1.6..7> TIM1 remapping
//       <i> Default: No Remap (ETR/PA12, CH1/PA8, CH2/PA9, CH3/PA10, CH4/PA11, BKIN/PB12, CH1N/PB13, CH2N/PB14, CH3N/PB15)
//                <0=> No Remap (ETR/PA12, CH1/PA8, CH2/PA9, CH3/PA10, CH4/PA11, BKIN/PB12, CH1N/PB13, CH2N/PB14, CH3N/PB15)
//                <1=> Partial Remap (ETR/PA12, CH1/PA8, CH2/PA9, CH3/PA10, CH4/PA11, BKIN/PA6, CH1N/PA7, CH2N/PB0, CH3N/PB1)
//                <3=> Full Remap (ETR/PE7, CH1/PE9, CH2/PE11, CH3/PE13, CH4/PE14, BKIN/PE15, CH1N/PE8, CH2N/PE10, CH3N/PE12)
//     <o1.8..9> TIM2 remapping
//       <i> Default: No Remap (CH1/ETR/PA0, CH2/PA1, CH3/PA2, CH4/PA3)
//                <0=> No Remap (CH1/ETR/PA0, CH2/PA1, CH3/PA2, CH4/PA3)
//                <1=> Partial Remap (CH1/ETR/PA15, CH2/PB3, CH3/PA2, CH4/PA3)
//                <2=> Partial Remap (CH1/ETR/PA0, CH2/PA1, CH3/PB10, CH4/PB11)
//                <3=> Full Remap (CH1/ETR/PA15, CH2/PB3, CH3/PB10, CH4/PB11)
//     <o1.10..11> TIM3 remapping
//       <i> Default: No Remap (CH1/PA6, CH2/PA7, CH3/PB0, CH4/PB1)
//                <0=> No Remap (CH1/PA6, CH2/PA7, CH3/PB0, CH4/PB1)
//                <2=> Partial Remap (CH1/PB4, CH2/PB5, CH3/PB0, CH4/PB1)
//                <3=> Full Remap (CH1/PC6, CH2/PC7, CH3/PC8, CH4/PC9)
//     <o1.12> TIM4 remapping
//       <i> Default: No Remap (CH1/PB6, CH2/PB7, CH3/PB8, CH4/PB9)
//                <0=> No Remap (CH1/PB6, CH2/PB7, CH3/PB8, CH4/PB9)
//                <1=> Remap (CH1/PD12, CH2/PD13, CH3/PD14, CH4/PD15)
//     <o1.13..14> CAN remapping
//       <i> Default: No Remap (CANRX/PA11, CANTX/PA12)
//                <0=> No Remap (CANRX/PA11, CANTX/PA12)
//                <2=> Remap (CANRX/PB8, CANTX/PB9)
//                <3=> Remap (CANRX/PD0, CANTX/PPD1)
//     <o1.15> PD01 remapping
//       <i> Default: No Remap
//                <0=> No Remap
//                <1=> Remap (PD0/OSCIN, PD1/OSC_OUT)
//     <o1.24..26> Serial wire JTAG configuration
//       <i> Default: Full SWJ (JTAG-DP + SW-DP)
//                <0=> Reset State: Full SWJ (JTAG-DP + SW-DP)
//                <1=> Full SWJ (JTAG-DP + SW-DP) but without NJTRST
//                <2=> JTAG-DP Disabled and SW-DP Enabled
//                <4=> JTAG-DP Disabled and SW-DP Disabled
//   </h>
// </e>

#define __GPIO_AFIOEN  1
#define __AFIO_MAPR    0x00000C00

//<h> USART Configuration
//  <e0> USART1 enable
//      <o1> Baudrate 
//            <9600=>    9600 Baud
//            <14400=>   14400 Baud
//            <19200=>   19200 Baud
//            <28800=>   28800 Baud
//            <38400=>   38400 Baud
//            <56000=>   56000 Baud
//            <57600=>   57600 Baud
//            <115200=>  115200 Baud
//      <o2.12> Data Bits 
//            <0=> 8 Data Bits
//            <1=> 9 Data Bits
//      <o3.12..13> Stop Bits
//            <1=> 0.5 Stop Bit
//            <0=>   1 Stop Bit
//            <3=> 1.5 Stop Bits
//            <2=>   2 Stop Bits
//      <o2.9..10> Parity 
//            <0=> No Parity
//            <2=> Even Parity
//            <3=> Odd Parity
//      <o4> Softwire receiver (RX) buffer size
//            <4=>   4 byte
//            <8=>   8 byte
//            <16=>  16 byte
//            <32=>  32 byte
//            <64=>  64 byte
//            <128=> 128 byte
//            <256=> 256 byte
//            <512=> 512 byte
//            <1024=> 1024 byte
//      <o5> Softwire transmitter (TX) buffer size
//            <4=>   4 byte
//            <8=>   8 byte
//            <16=>  16 byte
//            <32=>  32 byte
//            <64=>  64 byte
//            <128=> 128 byte
//            <256=> 256 byte
//            <512=> 512 byte
//            <1024=> 1024 byte
//  </e>

#define __USART1_USED      1
#define __USART1_BAUDRATE  115200
#define __USART1_CR1       0x00000000
#define __USART1_CR2       0x00000000
#define __USART1_RX_BUF    128
#define __USART1_TX_BUF    1024

//  <e0> USART2 enable
//      <o1> Baudrate 
//            <9600=>    9600 Baud
//            <14400=>   14400 Baud
//            <19200=>   19200 Baud
//            <28800=>   28800 Baud
//            <38400=>   38400 Baud
//            <56000=>   56000 Baud
//            <57600=>   57600 Baud
//            <115200=>  115200 Baud
//      <o2.12> Data Bits 
//            <0=> 8 Data Bits
//            <1=> 9 Data Bits
//      <o3.12..13> Stop Bits
//            <1=> 0.5 Stop Bit
//            <0=>   1 Stop Bit
//            <3=> 1.5 Stop Bits
//            <2=>   2 Stop Bits
//      <o2.9..10> Parity 
//            <0=> No Parity
//            <2=> Even Parity
//            <3=> Odd Parity
//      <o4> Softwire receiver (RX) buffer size
//            <4=>   4 byte
//            <8=>   8 byte
//            <16=>  16 byte
//            <32=>  32 byte
//            <64=>  64 byte
//            <128=> 128 byte
//            <256=> 256 byte
//            <512=> 512 byte
//            <1024=> 1024 byte
//      <o5> Softwire transmitter (TX) buffer size
//            <4=>   4 byte
//            <8=>   8 byte
//            <16=>  16 byte
//            <32=>  32 byte
//            <64=>  64 byte
//            <128=> 128 byte
//            <256=> 256 byte
//            <512=> 512 byte
//            <1024=> 1024 byte
//  </e>

#define __USART2_USED      1
#define __USART2_BAUDRATE  115200
#define __USART2_CR1       0x00000000
#define __USART2_CR2       0x00000000
#define __USART2_RX_BUF    1024
#define __USART2_TX_BUF    1024

