MakenL/System_STM32F103x/inc/system_stm32f103x.h
//  <e0> USART3 enable
//      <o1> Baudrate 
//            <9600=>    9600 Baud
//            <14400=>   14400 Baud
//            <19200=>   19200 Baud
//            <28800=>   28800 Baud
//            <38400=>   38400 Baud
//            <56000=>   56000 Baud
//            <57600=>   57600 Baud
//            <115200=>  115200 Baud
//      <o2.12> Data Bits 
//            <0=> 8 Data Bits
//            <1=> 9 Data Bits
//      <o3.12..13> Stop Bits
//            <1=> 0.5 Stop Bit
//            <0=>   1 Stop Bit
//            <3=> 1.5 Stop Bits
//            <2=>   2 Stop Bits
//      <o2.9..10> Parity 
//            <0=> No Parity
//            <2=> Even Parity
//            <3=> Odd Parity
//      <o4> Softwire receiver (RX) buffer size
//            <4=>   4 byte
//            <8=>   8 byte
//            <16=>  16 byte
//            <32=>  32 byte
//            <64=>  64 byte
//            <128=> 128 byte
//            <256=> 256 byte
//            <512=> 512 byte
//            <1024=> 1024 byte
//      <o5> Softwire transmitter (TX) buffer size
//            <4=>   4 byte
//            <8=>   8 byte
//            <16=>  16 byte
//            <32=>  32 byte
//            <64=>  64 byte
//            <128=> 128 byte
//            <256=> 256 byte
//            <512=> 512 byte
//            <1024=> 1024 byte
//  </e>

#define __USART3_USED      0
#define __USART3_BAUDRATE  115200
#define __USART3_CR1       0x00000000
#define __USART3_CR2       0x00000000
#define __USART3_RX_BUF    8
#define __USART3_TX_BUF    8

//</h>
//<h> I2C Configuration
//  <e0> I2C1 enable
//  <i> Master mode and 7-bit addressing only.
//  <i> I2C is used with polling.
//      <o1> Speed 
//            <100000=> Sm 100 kHz
//            <400000=> Fm 400 kHz
//  </e>
//  <e2> I2C2 enable
//  <i> Master mode and 7-bit addressing only.
//  <i> I2C is used with polling.
//      <o3> Speed 
//            <100000=> Sm 100 kHz
//            <400000=> Fm 400 kHz
//  </e>
//</h>

#define __I2C1_USED    0
#define __I2C1_SPEED   100000
#define __I2C2_USED    0
#define __I2C2_SPEED   100000



//**************************** <<< end of configuration section >>> ****************************

#if   ((__RCC_CFGR & 0x00000003) == 0x00)
	#if __HSION
	  // HSI is used as system clock
    #define __SYSCLK_CLOCK   __HSI_CLOCK
	#else
	  #error "HSI is disable (see configuration wizard)"
	#endif
#elif ((__RCC_CFGR & 0x00000003) == 0x01)
	#if __HSEON
	  // HSE is used as system clock
    #define __SYSCLK_CLOCK   __HSE_CLOCK
	#else
	  #error "HSE is disable (see configuration wizard)"
	#endif
#elif ((__RCC_CFGR & 0x00000003) == 0x02)
	#if __PLLON
    // PLL is used as system clock
    #define __PLLMULL  (((__RCC_CFGR & 0x003C0000) >> 18) + 2)
	#else
	  #error "PLL is disable (see configuration wizard)"
	#endif

  // HSE is PLL clock source
  #if (__RCC_CFGR & 0x00010000)
	
		#if __HSEON
	    // HSE/2 is used
      #if (__RCC_CFGR & 0x00020000)
        // SYSCLK = HSE/2 * pllmull		
        #define __SYSCLK  ((__HSE_CLOCK >> 1) * __PLLMULL)
      // HSE is used
			#else
		    // SYSCLK = HSE   * pllmul
        #define __SYSCLK  ((__HSE_CLOCK >> 0) * __PLLMULL)
      #endif 
	  #else
	    #error "HSE is disable (see configuration wizard)"
	  #endif
	// HSI/2 is PLL clock source
  #else
		#if __HSION
	    // SYSCLK = HSI/2 * pllmul
      #define __SYSCLK  ((__HSI_CLOCK >> 1) * __PLLMULL)
	  #else
	    #error "HSI is disable (see configuration wizard)"
	  #endif
  #endif
#else
   #error "Value of System Clock Switch is not correct (see configuration wizard)"
#endif

#if __SYSCLK > 72000000
	#error "Value of SYSCLK is more than 72 MHz (see configuration wizard)"
#else
		
  #if (((__RCC_CFGR & 0x000000F0) >> 4) & 0x08)
    #define __HCLK  (__SYSCLK >> ((((__RCC_CFGR & 0x000000F0) >> 4) & 0x07)+1))
  #else
    #define __HCLK  (__SYSCLK)
  #endif
	
  #if (((__RCC_CFGR & 0x00000700) >> 8) & 0x04)
    #define __PCLK1 (__HCLK >> ((((__RCC_CFGR & 0x00000700) >> 8) & 0x03) + 1))
  #else
    #define __PCLK1 (__HCLK)
  #endif
			
  #if (((__RCC_CFGR & 0x00003800) >> 11) & 0x04)
    #define __PCLK2 (__HCLK >> ((((__RCC_CFGR & 0x00003800) >> 11) & 0x03)+1))
  #else
    #define __PCLK2 (__HCLK)
  #endif
		
	#if __HCLK > 72000000
	  #error "Value of HCLK is more than 72 MHz (see configuration wizard)"
  #endif
		
	#if __PCLK1 > 36000000
	  #error "Value of PCLK1 is more than 36 MHz (see configuration wizard)"
  #endif		
		
#endif

/* КОНСТАНТЫ
 *************************************************************************************************/

/* МАКРОСЫ
 ************************************************************************************************/

// Вспомогательные макросы для макроса BIT_BAND_REG
#define _MASK_TO_BIT31(A)        (A==0x80000000)? 31 : 0
#define _MASK_TO_BIT30(A)        (A==0x40000000)? 30 : _MASK_TO_BIT31(A)
#define _MASK_TO_BIT29(A)        (A==0x20000000)? 29 : _MASK_TO_BIT30(A)
#define _MASK_TO_BIT28(A)        (A==0x10000000)? 28 : _MASK_TO_BIT29(A)
#define _MASK_TO_BIT27(A)        (A==0x08000000)? 27 : _MASK_TO_BIT28(A)
#define _MASK_TO_BIT26(A)        (A==0x04000000)? 26 : _MASK_TO_BIT27(A)
#define _MASK_TO_BIT25(A)        (A==0x02000000)? 25 : _MASK_TO_BIT26(A)
#define _MASK_TO_BIT24(A)        (A==0x01000000)? 24 : _MASK_TO_BIT25(A)
#define _MASK_TO_BIT23(A)        (A==0x00800000)? 23 : _MASK_TO_BIT24(A)
#define _MASK_TO_BIT22(A)        (A==0x00400000)? 22 : _MASK_TO_BIT23(A)
#define _MASK_TO_BIT21(A)        (A==0x00200000)? 21 : _MASK_TO_BIT22(A)
#define _MASK_TO_BIT20(A)        (A==0x00100000)? 20 : _MASK_TO_BIT21(A)
#define _MASK_TO_BIT19(A)        (A==0x00080000)? 19 : _MASK_TO_BIT20(A)
#define _MASK_TO_BIT18(A)        (A==0x00040000)? 18 : _MASK_TO_BIT19(A)
#define _MASK_TO_BIT17(A)        (A==0x00020000)? 17 : _MASK_TO_BIT18(A)
#define _MASK_TO_BIT16(A)        (A==0x00010000)? 16 : _MASK_TO_BIT17(A)
#define _MASK_TO_BIT15(A)        (A==0x00008000)? 15 : _MASK_TO_BIT16(A)
#define _MASK_TO_BIT14(A)        (A==0x00004000)? 14 : _MASK_TO_BIT15(A)
#define _MASK_TO_BIT13(A)        (A==0x00002000)? 13 : _MASK_TO_BIT14(A)
#define _MASK_TO_BIT12(A)        (A==0x00001000)? 12 : _MASK_TO_BIT13(A)
#define _MASK_TO_BIT11(A)        (A==0x00000800)? 11 : _MASK_TO_BIT12(A)
#define _MASK_TO_BIT10(A)        (A==0x00000400)? 10 : _MASK_TO_BIT11(A)
#define _MASK_TO_BIT09(A)        (A==0x00000200)? 9  : _MASK_TO_BIT10(A)
#define _MASK_TO_BIT08(A)        (A==0x00000100)? 8  : _MASK_TO_BIT09(A)
#define _MASK_TO_BIT07(A)        (A==0x00000080)? 7  : _MASK_TO_BIT08(A)
#define _MASK_TO_BIT06(A)        (A==0x00000040)? 6  : _MASK_TO_BIT07(A)
#define _MASK_TO_BIT05(A)        (A==0x00000020)? 5  : _MASK_TO_BIT06(A)
#define _MASK_TO_BIT04(A)        (A==0x00000010)? 4  : _MASK_TO_BIT05(A)
#define _MASK_TO_BIT03(A)        (A==0x00000008)? 3  : _MASK_TO_BIT04(A)
#define _MASK_TO_BIT02(A)        (A==0x00000004)? 2  : _MASK_TO_BIT03(A)
#define _MASK_TO_BIT01(A)        (A==0x00000002)? 1  : _MASK_TO_BIT02(A)
#define _MASK_TO_BIT(A)          (A==0x00000001)? 0  : _MASK_TO_BIT01(A)


/** @brief Макрос позволяет записать/читать биты регистров STM32F103x с помощью области bitbanding.
    @param REG - регистр STM32F103x (не указатель на него!)
    @param BIT_MASK - маска бита в соответствии с описанием в заголовочном файле stm32f103x.h.  
    @code
    // Пример применения:
    BIT_BAND_REG(TIM1->SR, TIM_SR_UIF) = VALUE; // запись бита TIM_SR_UIF в регистр TIM1->SR
    VALUE = BIT_BAND_REG(TIM1->SR, TIM_SR_UIF); // чтение бита TIM_SR_UIF из регистра TIM1->SR
    @endcode
    @warning Внимание! Можно использовать маски, которые описывают конкретный бит, а не группу битов.
 */
#define BIT_BAND_REG(REG,BIT_MASK) (*(volatile uint32_t*)(PERIPH_BB_BASE+32*((uint32_t)(&(REG))-PERIPH_BASE)+4*((uint32_t)(_MASK_TO_BIT(BIT_MASK)))))

// Маски для настройки входов GPIO
#define GPIO_MODE_INPUT_ANALOG              0x00  ///< Аналоговый вход
#define GPIO_MODE_INPUT_FLOATING            0x04  ///< Вход HiZ, без подтяжки
#define GPIO_MODE_INPUT_PULL_UP_DOWN        0x08  ///< Вход с подтяжкой
#define GPIO_MODE_OUTPUT2_PUSH_PULL         0x02  ///< Двухтактный выход, скорость 2МГц
#define GPIO_MODE_OUTPUT10_PUSH_PULL        0x01  ///< Двухтактный выход, скорость 10МГц
#define GPIO_MODE_OUTPUT50_PUSH_PULL        0x03  ///< Двухтактный выход, скорость 50МГц
#define GPIO_MODE_OUTPUT2_OPEN_DRAIN        0x06  ///< Выход открытый коллектор, скорость 2МГц
#define GPIO_MODE_OUTPUT10_OPEN_DRAIN       0x05  ///< Выход открытый коллектор, скорость 10МГц
#define GPIO_MODE_OUTPUT50_OPEN_DRAIN       0x07  ///< Выход открытый коллектор, скорость 50МГц
#define GPIO_MODE_OUTPUT2_ALT_PUSH_PULL     0x0A  ///< Двухтактный выход альтернативных функций, скорость 2МГц
#define GPIO_MODE_OUTPUT10_ALT_PUSH_PULL    0x09  ///< Двухтактный выход альтернативных функций, скорость 10МГц
#define GPIO_MODE_OUTPUT50_ALT_PUSH_PULL    0x0B  ///< Двухтактный выход альтернативных функций, скорость 50МГц
#define GPIO_MODE_OUTPUT2_ALT_OPEN_DRAIN    0x0E  ///< Выход альтернативных функций с открытым коллектором, скорость 2МГц
#define GPIO_MODE_OUTPUT10_ALT_OPEN_DRAIN   0x0D  ///< Выход альтернативных функций с открытым коллектором, скорость 10МГц
#define GPIO_MODE_OUTPUT50_ALT_OPEN_DRAIN   0x0F  ///< Выход альтернативных функций с открытым коллектором, скорость 50МГц
 
//  Вспомогательные макросы для макроса GPIO_INIT_PIN
#define GPIO_INIT_CRL(PORT,PIN_NUM,PIN_MODE) PORT->CRL = (PORT->CRL &(~((uint32_t)0x0F<<(((PIN_NUM) & 0x07)<<2)))) | (((uint32_t)(PIN_MODE)&0x0F)<<(((PIN_NUM) & 0x07)<<2))
#define GPIO_INIT_CRH(PORT,PIN_NUM,PIN_MODE) PORT->CRH = (PORT->CRH &(~((uint32_t)0x0F<<(((PIN_NUM) & 0x07)<<2)))) | (((uint32_t)(PIN_MODE)&0x0F)<<(((PIN_NUM) & 0x07)<<2))

/** @brief Макрос настраивает пин порта ввода/вывода STM32F103x
    @param PORT - название порта (GPIOA, GPIOB, GPIOC и т.д.)
    @param NUM  - номер пина (число от 0 до 15)
    @param MODE - режим пина согласно маски, описанной как GPIO_MODE_...
    @code
    // Пример применения:
    GPIO_INIT(GPIOA,1,GPIO_MODE_OUTPUT2_PUSH_PULL); // настройка 1 пина порта GPIOA на выход двухтактный 2МГц
    @endcode
 */
#define GPIO_INIT(PORT,NUM,MODE)     ((NUM)<8)? (GPIO_INIT_CRL(PORT,NUM,MODE)):(GPIO_INIT_CRH(PORT,NUM,MODE)) 


/** @brief Макрос устанавливает пин порта ввода/вывода STM32F103x
    @param PORT - название порта (GPIOA, GPIOB, GPIOC и т.д.)
    @param NUM  - номер пина (число от 0 до 15)
    @code
    // Пример применения:
    GPIO_SET(GPIOA,1); // установка 1 пина порта GPIOA
    @endcode
 */
#define GPIO_SET(PORT,NUM)   (PORT -> BSRR |= ((uint32_t)0x00000001 << NUM))

/** @brief Макрос сбрасывает пин порта ввода/вывода STM32F103x
    @param PORT - название порта (GPIOA, GPIOB, GPIOC и т.д.)
    @param NUM  - номер пина (число от 0 до 15)
    @code
    // Пример применения:
    GPIO_RESET(GPIOA,1); // сброс 1 пина порта GPIOA
    @endcode
 */
#define GPIO_RESET(PORT,NUM) (PORT -> BSRR |= ((uint32_t)0x00010000 << NUM))

/* ОПРЕДЕЛЕНИЕ ТИПОВ
 *************************************************************************************************/	 

/// Коды ошибок
typedef enum 
{
  SUCCESS                      = 0, 
  ERROR_POINTER_IS_NULL        = 1,    ///< Указатель равен NULL
  ERROR_INVALID_ARGUMENT_VALUE = 2,    ///< Некорректное значение аргумента
  ERROR_INVALID_SEQUENCE       = 8,    ///< Не верная последовательность операций
  ERROR_TIMEOUT                = 9,    ///< Истечение таймаута
  ERROR_USART_BUFFER_IS_EMPTY  = 10,   ///< Программный буфер Usart пуст
  ERROR_USART_BUFFER_IS_FULL   = 11,   ///< Программный буфер Usart полон
  ERROR_I2C_START              = 40,   ///< Не удалось сформировать START на шине
  ERROR_I2C_BUS_IS_BUSY        = 41,   ///< Шина заблокирована
  ERROR_I2C_DEVICE_NOT_FOUND   = 42,   ///< Не получен ACK в ответ на адрес
  ERROR_I2C_DEVICE_BUSY        = 43    ///< Не получен ACK в ответ переданный байт
} ErrorStatus_t;

/// Системные частоты микроконтролера
typedef enum
{
  FREQ_SYSCLK = 0, ///< Системная частота
  FREQ_HCLK   = 1, ///< Частота шины AHB
  FREQ_PCLK1  = 2, ///< Частота шины APB1
  FREQ_PCLK2  = 3  ///< Частота шины APB2
} SystemFreq_t;

