MakenL/System_STM32F103x/inc/system_stm32f103x.h
/* ОПРЕДЕЛЕНИЕ ГЛОБАЛЬНЫХ ПЕРЕМЕННЫХ
 *************************************************************************************************/

/* ПРОТОТИПЫ ГЛОБАЛЬНЫХ ФУНКЦИЙ
 *************************************************************************************************/	

// Функция инициализации микроконтроллера
void SystemInit(void);
// Функция возвращает текущие системные частоты
uint32_t RCC_GetSysClock(SystemFreq_t FreqType);

// Функция реализовывает блокирующую задержку
void DelayMs(uint32_t Delay);

ErrorStatus_t BKP_GetRegister(const uint8_t nRegister, uint16_t *const Value);
ErrorStatus_t BKP_SetRegister(const uint8_t nRegister, const uint16_t Value);

#if __RTC_USED
// Инициализация модуля RTC
void RTC_Init(void (*SecExec_Handler)(void), void (*AlarmExec_Handler)(void));
// Получить значение из счетчика RTC
uint32_t RTC_GetCount(void);
// Записать значение в счетчик RTC
void RTC_SetCount(const uint32_t Value);
// Получить значение из регистра будильника RTC
uint32_t RTC_GetAlarm(void);
// Записать значение в регистр будильника RTC
void RTC_SetAlarm(const uint32_t Value);
#endif

#if (__USART1_USED || __USART2_USED || __USART3_USED)
// Инициализация модулей USART
void USART_Init(void);
#endif
#if __USART1_USED
// Передача символа через модуль USART1
ErrorStatus_t USART1_Transmit_IT(const char vChar);
// Чтение символа принятого из модуля USART1
ErrorStatus_t USART1_Receive_IT(char *const pChar);
// Передача строки через модуль USART1
void USART1_TransmitStr(const char *pString);
#endif
#if __USART2_USED
// Передача символа через модуль USART1
ErrorStatus_t USART2_Transmit_IT(const char vChar);
// Чтение символа принятого из модуля USART1
ErrorStatus_t USART2_Receive_IT(char *const pChar);
// Передача строки через модуль USART1
void USART2_TransmitStr(const char *pString);
#endif
#if __USART3_USED
// Передача символа через модуль USART1
ErrorStatus_t USART3_Transmit_IT(const char vChar);
// Чтение символа принятого из модуля USART1
ErrorStatus_t USART3_Receive_IT(char *const pChar);
// Передача строки через модуль USART1
void USART3_TransmitStr(const char *pString);
#endif

#if (__I2C1_USED || __I2C2_USED)
// Функция инициализации модулей I2C в режиме мастера
void I2C_MasterInit(void);
// Функция чтения 2 байт из ячейки памяти устройства I2C в режиме мастера
ErrorStatus_t I2C_MemRead(I2C_TypeDef *const pI2C, const uint8_t I2C_DevAdress, const uint8_t I2C_MemAdress, uint8_t *const pData, uint16_t Size);
// Функция записи 2 байт в ячейку памяти устройства I2C в режиме мастера
ErrorStatus_t I2C_MemWrite(I2C_TypeDef *const pI2C, const uint8_t I2C_DevAdress, const uint8_t I2C_MemAdress, uint8_t *const pData, uint16_t Size);
#endif


/* ОПИСАНИЕ INLINE ФУНКЦИЙ
 *************************************************************************************************/	

#if __SYSTICK_SETUP

__inline static ErrorStatus_t SysTick_Enable(uint16_t msPeriod) 
{
#if (__SYSTICK_CTRL & 0x04)
	uint32_t SysTickClock = RCC_GetSysClock(FREQ_HCLK);
#else
	uint32_t SysTickClock = RCC_GetSysClock(FREQ_HCLK) / 8;
#endif
	
	if ((msPeriod > __SYSTICK_MAXPERIOD) || ((msPeriod * (SysTickClock/1000) - 1) > SysTick_LOAD_RELOAD_Msk))
	{
		return ERROR_INVALID_ARGUMENT_VALUE;
	}
	else
	{
		SysTick->LOAD  = msPeriod * (SysTickClock/1000) - 1; // установка значения в регистр перезагрузки
    SysTick->CTRL  = __SYSTICK_CTRL;                     // установка регистра настройки таймера
    SysTick->VAL   =  0;                                 // очистка счетчика
    SysTick->CTRL |= SysTick_CTRL_ENABLE_Msk;            // включение таймера
    return SUCCESS; 
	}
}

__inline static void SysTick_Disable(void)
{ 
	// Выключить таймер и прерывание SysTick
  SysTick->CTRL  &= ~(SysTick_CTRL_TICKINT_Msk | SysTick_CTRL_ENABLE_Msk);
}

#endif

#ifdef __cplusplus
}
#endif

#endif

/* КОНЕЦ ФАЙЛА
 *************************************************************************************************/
